Autodesk.Revit.DB.ForgeDM.CloudModel.GetModelPath
Gets ModelPath of this model.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.GetHub
Gets ForgeDM hub of this model.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.GetProject
Gets ForgeDM project of this model.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.GetFolder
Gets ForgeDM folder of this model.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.IsWorkshared
Indicates if the model is workshared or not.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.GUID
Revit cloud model GUID.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.Name
Model name.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.Id
Model identifier.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.#ctor(Autodesk.Revit.DB.ForgeDM.CloudFolder,System.String,System.String,System.Guid)
Default constructor for CloudModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.#ctor(System.String,System.String,System.Guid)
Default constructor for CloudModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel.#ctor(Autodesk.Revit.DB.ForgeDM.CloudModel)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudModel
Revit Cloud Model from Forge Data Management/BIM 360 Docs or Autodesk Docs.
Since:
2022